"""
Словник - це список з ключ: значення

Тобто, ми створюємо ключ, якому даємо якесь значення
Приклад: 
info = {"імя": "Андрій", "років": 11}
^^^
В цьому випадку, імя та років це ключі, а андрій та 11 це їх значення

Ключ:значення
"""

info = {"name": "Andrew", "age": 11}

"""
Щоб вивести щось з словника, треба використовувати вбудовані цикли або функції

Щоб вивести всі ключі, можна вивести print(info.keys())
А щоб вивести всі значення, можна вивсети print(info.values())

Проте, щоб одразу працювати і з ключом і з його значенням, використовують двойний цикл
for key, value in info.items():
    print(f"{key} - {value}")
"""

for key, value in info.items():
    print(f"{key} - {value}")


def dict_n1(satat):
    for key, value in satat.items():
        print(f"{key} - {value}")


stat = {"name": "Andrew", "age": 11, "kg": 39.6}
info = {"name": "Misha", "age": 15, "kg": 55}
dict_n1(info)
