# Функція це блок коду, який виконує певну задачу
"""
Створення:
def назва_функції(назва_аргумент1, назва_аргумент2):
    робота

Визивання:
    назва_функції(аргумент1, аргумент2)

Функція може не приймати зовсім аргументів, або може приймати їх нескінченно
"""

def add_two_numbers(num1, num2):
    print(num1+num2)

add_two_numbers(1, 2)

# =======================================

def add_two_numbers(num1, num2):
    return num1+num2

print(add_two_numbers(1, 2))

# Якщо ми використовуємо return в функції, то ми маємо прінтити саму функцію
# print(назва_функції(аргумент1б аргумент2))